init.el

(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
(load-theme 'tron t)

(setq ring-bell-function 'ignore)

(tool-bar-mode -1)

(when (memq window-system '(mac ns))
       (setq mac-option-modifier 'super
             mac-command-modifier 'meta
             ns-right-command-modifier 'alt))

     (use-package exec-path-from-shell
       :ensure t
       :config (exec-path-from-shell-initialize))

(exec-path-from-shell-initialize)

(put 'scroll-left 'disabled nil)
(put 'erase-buffer 'disabled nil)
(defadvice dired-mark-read-file-name (after rv:dired-create-dir-when-needed (prompt dir op-symbol arg files &optional default) activate)
  (when (member op-symbol '(copy move))
    (let ((directory-name (if (< 1 (length files))
                              ad-return-value
                              (file-name-directory ad-return-value))))
      (when (and (not (file-directory-p directory-name))
                 (y-or-n-p (format "directory %s doesn't exist, create it?" directory-name)))
        (make-directory directory-name t)))))
(defun what-face (pos)
  (interactive "d")
  (let ((face (or (get-char-property (point) 'read-face-name)
                  (get-char-property (point) 'face))))
    (if face (message "Face: %s" face) (message "No face at %d" pos))))

(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "init.org")))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "init.el")))))
(add-hook 'after-save-hook 'tangle-init)

(package-initialize)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile
  (require 'use-package))
(require 'diminish)
(require 'bind-key)

(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/"))

(setq org-src-fontify-natively t)

(add-hook 'window-setup-hook 'toggle-frame-maximized t)

(use-package dim
  :ensure t
  :config
  (dim-major-names
   '((emacs-lisp-mode           "EL")
     (inferior-emacs-lisp-mode  "EL>")
     (typescript-mode           "TS")
     (calendar-mode             "📆")))
  (dim-minor-names
   '((tide-mode                 " ti")
     (company-mode              " cmpy")
     (eldoc-mode                " doc"))))

(use-package yascroll
  :ensure t
  :config (global-yascroll-bar-mode 1))

(setq explicit-shell-file-name "/bin/bash")

(setq standard-indent 2
      tab-width 2)
(setq-default indent-tabs-mode nil
              tab-width 2)

(use-package indent-guide
  :ensure t
  :config (indent-guide-global-mode 1))

(use-package ace-jump-mode
  :ensure t
  :bind (("C-ü" . ace-jump-mode)
         ("<f9>" . ace-jump-mode)
         ("<f12>" . ace-jump-mode)
         ("<f8>" . ace-jump-char-mode)))
(use-package ace-window
  :ensure t
  :bind (("M-ü" . ace-window)
         ("A-ü" . ace-window)))
(use-package helm
  :ensure t)

(use-package helm-ag
  :ensure t
  :bind (("M-ö" . helm-ag)))
(use-package ido
  :ensure t
  :config (ido-mode 1))

(use-package ido-vertical-mode
  :ensure t
  :config
  (setq ido-vertical-define-keys 'C-n-and-C-p-only)
  (ido-vertical-mode 1))

(use-package smex
  :ensure t
  :config (global-set-key (kbd "M-x") 'smex))

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(setq backup-directory-alist `(("." . "~/.saves"))
      backup-by-copying t)

(use-package nov
  :ensure t
)

(use-package which-key
  :ensure t
  :config
    (which-key-mode))
