init.el

(add-hook 'emacs-lisp-mode-hook
          '(lambda () (progn
                        (show-paren-mode t)
                        (electric-pair-mode t))))

(use-package rainbow-delimiters
  :ensure t
  :init
    (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode))

(use-package web-mode
  :ensure t
  :mode ("\\.html\\'"  "\\.css\\'" "\\.tsx\\'" "\\.jsx\\'")
  :interpreter "web"
  :config
  (setq web-mode-enable-auto-quoting nil
        web-mode-enable-current-element-highlight t
        web-mode-markup-indent-offset 2))

(use-package emmet-mode
  :ensure t
  :commands (emmet-mode)
  :init
    (add-hook 'web-mode-hook #'emmet-mode)
  :config (when (and (stringp buffer-file-name)
                 (string-match "\\.css\\'" buffer-file-name))
            (setq emmet-use-css-transform t)))

(use-package js2-mode
  :ensure t
  :defer 1
  :mode "\\.js$"
  :config
    (add-hook 'js2-mode-hook 'prettify-symbols-mode)
    (add-hook 'js2-mode-hook
              (lambda ()
                'prettify-symbols-mode
                (push '("<=" . ?≤) prettify-symbols-alist)
                (push '(">=" . ?≥) prettify-symbols-alist)
                (push '("=>" . ?⟹) prettify-symbols-alist)
                (push '("!==" . ?≠) prettify-symbols-alist)))
    (font-lock-add-keywords 'js2-mode
                            '(("require" . font-lock-keyword-face)))
    (setq
     js-indent-level 2
     js2-basic-offset 2
     js2-bounce-indent-p t
     js2-strict-missing-semi-warning nil
     js2-concat-multiline-strings nil
     js2-include-node-externs t
     js2-skip-preprocessor-directives t
     js2-strict-inconsistent-return-warning nil))

(use-package indium
  :ensure t)
