init.org
*** typescript
   #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el
(defun is-current-line-end-of-function ()
    "returns nil if current line is end of a function expression"
    (string-match-p ")\\(: [^ ]*\\)?\\ \\(=> \\)?{" (thing-at-point 'line t)))

     (use-package tide
       :ensure t
       :defer 1
       :bind (("C-c <up>" . tide-jump-to-definition))
       :config
       (progn
         (add-hook 'typescript-mode-hook #'setup-tide-mode)
         (add-hook 'js2-mode-hook #'setup-tide-mode)
         (flycheck-add-next-checker 'typescript-tide '(t . typescript-tslint) 'append)
         (setq tide-format-options '(
                                 :insertSpaceAfterFunctionKeywordForAnonymousFunctions t
                                 :placeOpenBraceOnNewLineForFunctions nil))))

     (use-package typescript-mode
       :ensure t
       :mode "\\.ts$"
       :config
       (setq typescript-indent-level 2)
       (add-hook 'typescript-mode-hook 'prettify-symbols-mode)
       (add-hook 'typescript-mode-hook
                 (lambda ()
                   'prettify-symbols-mode
                   (push '("<=" . ?≤) prettify-symbols-alist)
                   (push '(">=" . ?≥) prettify-symbols-alist)
                   (push '("=>" . ?⟹) prettify-symbols-alist)
                   (push '("!==" . ?≠) prettify-symbols-alist)))
       (defun typescript--proper-indentation (parse-status)
         "Overwriting original function in order to fix multiparam/newline indentation"
         (save-excursion
           (back-to-indentation)
           (cond ((nth 4 parse-status)
                  (typescript--get-c-offset 'c (nth 8 parse-status)))
                 ((nth 8 parse-status) 0) ; inside string
                 ((typescript--ctrl-statement-indentation))
                 ((eq (char-after) ?#) 0)
                 ((save-excursion (typescript--beginning-of-macro)) 4)
                 ((nth 1 parse-status)
                  (let ((same-indent-p (looking-at
                                        "[]})]\\|\\_<case\\_>\\|\\_<default\\_>"))
                        (continued-expr-p (typescript--continued-expression-p)))
                    (goto-char (nth 1 parse-status))
                    (if (looking-at "[({[]\\s-*\\(/[/*]\\|$\\)")
                        (progn
                          (skip-syntax-backward " ")
                          (when (eq (char-before) ?\)) (backward-list))


                          (if (is-current-line-end-of-function)
                              (unless (string-match-p "[(]" (thing-at-point 'line t))
                              (condition-case nil
                                  (re-search-backward "[(]")
                                (error nil))))

                          (back-to-indentation)
                          (cond (same-indent-p
                                 (current-column))
                                (continued-expr-p
                                 (+ (current-column) (* 2 typescript-indent-level)
                                    typescript-expr-indent-offset))
                                (t
                                 (+ (current-column) typescript-indent-level))))
                      (unless same-indent-p
                        (forward-char)
                        (skip-chars-forward " \t"))
                      (current-column))))
                 ((typescript--continued-expression-p)
                  (+ typescript-indent-level typescript-expr-indent-offset))
                 (t 0)))))
     (defun setup-tide-mode()
       (interactive)
       (tide-setup)
         ;; (flycheck-mode +1)
         ;; (setq flycheck-check-syntax-automatically '(save mode-enabled))
         (eldoc-mode +1)
         (tide-hl-identifier-mode +1)
         (company-mode +1))
     (defun next-import ()
       (condition-case nil
           (progn
             (re-search-forward "^import.*from.*$")
             (move-beginning-of-line 1))
         (error
          (goto-char (point-max)))))

     (defun import-start-key ()
       (search-forward "'" nil nil)
       ;; find  a better way to return nil
       (quote nil))

     (defun import-sort ()
         "Typescript/ES6 import sort"
         (interactive)
         (save-excursion
           (goto-char (point-min))
           (next-import)
               (sort-subr nil 'next-import 'end-of-line 'import-start-key 'import-start-key)))
   #+END_SRC





   #+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el

   #+END_SRC
